Documents/СообщениеБанкротства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СообщениеБанкротства</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИдентификаторыСообщенийБанкротство</xr:Item>
				<xr:Item>InformationRegister.ДанныеСообщенийОБанкротстве</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДДолжника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСудебногоДела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанкротствоЗначенияСвойств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСудебногоРешения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанкротствоЗначенияСвойств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеСообщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанкротствоИерархияСвойств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанкротствоЗначенияСвойств</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГУИД</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РодительГУИД</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДанныеСообщенийОБанкротстве.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДанныеСообщенийОБанкротстве</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанкротствоЗначенияСвойств</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДДолжника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвойствоСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанкротствоИерархияСвойств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГУИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИдентификаторыСообщенийБанкротство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыСообщенийБанкротство</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ИДСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДДолжника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСудебногоДела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/СообщениеБанкротства/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СообщениеБанкротстваДанныеСообщения.Свойство КАК СвойствоСообщения,
	|	СообщениеБанкротстваДанныеСообщения.Значение КАК ЗначениеСообщения,
	|	СообщениеБанкротстваДанныеСообщения.ГУИД КАК ГУИД
	|ИЗ
	|	Документ.СообщениеБанкротства.ДанныеСообщения КАК СообщениеБанкротстваДанныеСообщения
	|ГДЕ
	|	СообщениеБанкротстваДанныеСообщения.Ссылка = &Ссылка
	|	И СообщениеБанкротстваДанныеСообщения.Значение <> """"";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей       = РегистрыСведений.ДанныеСообщенийОБанкротстве.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	Пока Выборка.Следующий() Цикл	
		НоваяЗапись        = НаборЗаписей.Добавить();
		НоваяЗапись.Период = Дата;		
		НоваяЗапись.Контрагент = Контрагент;
		НоваяЗапись.ИДДолжника = ИДДолжника;
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);		  
	КонецЦикла;
	НаборЗаписей.Записать(); 
	
	НаборЗаписей       = РегистрыСведений.ИдентификаторыСообщенийБанкротство.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НоваяЗапись        = НаборЗаписей.Добавить();
	НоваяЗапись.ИДСообщения = Номер;
	НоваяЗапись.ИДДолжника = ИДДолжника;
	НоваяЗапись.НомерСудебногоДела = НомерСудебногоДела;
	НаборЗаписей.Записать();
	
	Если Не ЗначениеЗаполнено(НомерСудебногоДела) Тогда
		
		СобытиеЗафиксировано = КредитныеИстории.СобытиеСубъектаЗафиксированоИсточником(Контрагент, ЭтотОбъект.Ссылка, "1.12");
		Если Не СобытиеЗафиксировано Тогда 
			КредитныеИстории.ЗаписатьСобытиеСубъекта(Контрагент, ЭтотОбъект.Дата, ЭтотОбъект.Ссылка, "1.12");		 
		КонецЕсли;  
		
	КонецЕсли;

	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
		мНомерСудебногоДела = ДанныеСообщения.НайтиСтроки(Новый Структура("Свойство", Справочники.БанкротствоИерархияСвойств.НайтиПоРеквизиту("ПолныйПутьКДанным","Сообщение/CaseNumber/")));
		Если мНомерСудебногоДела.Количество( ) <> 0  Тогда
			НомерСудебногоДела = мНомерСудебногоДела[0].Значение;	
		КонецЕсли;
		
		мИДДолжника = ДанныеСообщения.НайтиСтроки(Новый Структура("Свойство", Справочники.БанкротствоИерархияСвойств.НайтиПоРеквизиту("ПолныйПутьКДанным","Сообщение/BankruptId/")));
		Если мИДДолжника.Количество() <> 0 Тогда
			ИДДолжника = мИДДолжника[0].Значение;	
		КонецЕсли;

		мТипСообщения = ДанныеСообщения.НайтиСтроки(Новый Структура("Свойство", Справочники.БанкротствоИерархияСвойств.НайтиПоРеквизиту("ПолныйПутьКДанным","Сообщение/MessageInfo/MessageType/")));
		Если мТипСообщения.Количество() <> 0 Тогда
			ТипСообщения = мТипСообщения[0].Значение;	
		КонецЕсли;	
		
		мТипСудебногоРешения = ДанныеСообщения.НайтиСтроки(Новый Структура("Свойство", Справочники.БанкротствоИерархияСвойств.НайтиПоРеквизиту("ПолныйПутьКДанным","Сообщение/MessageInfo/CourtDecision/DecisionType/Name/")));
		Если мТипСудебногоРешения.Количество() <> 0 Тогда
			ТипСудебногоРешения = мТипСудебногоРешения[0].Значение;	
		КонецЕсли;

КонецПроцедуры
